import os
import nltk.data

SCRIPT_DIR = os.path.dirname(os.path.abspath(__file__))

TEXT = """Ўзбекистон Республикаси Конституцияси Ўн иккинчи чақириқ Ўзбекистон
   Республикаси Олий Кенгашининг ўн биринчи сессиясида 1992 йил 8
   декабрда қабул қилинган.

   (2002 йил 27 январда ўтказилган умумхалқ референдуми натижаларига
   кўра ҳамда унинг асосида Ўзбекистон Республикасининг 2003 йил 24
   апрелда қабул қилинган Қонунига мувофиқ Ўзбекистон Республикасининг
   Конституцияси XVIII, XIX, XX, XXIII бобларига ўзгартишлар ва
   қўшимчалар киритилган. Ўзбекистон Республикасининг 2007 йил 11
   апрелда қабул қилинган Қонуни билан Ўзбекистон Республикасининг
   Конституцияси 89-модаасига, 93- моддасининг 15-бандига,
   102-моддасининг иккинчи қисмига тузатишлар киритилган. Ўзбекистон
   Республикасининг 2008 йил 25 декабрда қабул қилинган Қонуни билан
   Ўзбекистон Республикасининг Конституцияси 77-моддасининг биринчи
   қисмига ўзгартиш киритилган. Ўзбекистон Республикасининг 2011 йил 18
   апрелда қабул қилинган Қонуни билан Ўзбекистон Республикасининг
   Конституцияси 78, 80, 93, 96 ва 98-моддаларига ўзгартиш ва қўшимчалар
   киритилган. Ўзбекистон Республикасининг 2011 йил 12 декабрда қабул
   қилинган Қонуни билан Ўзбекистон Республикасининг Конституцияси
   90-моддасининг иккинчи қисмига тузатиш киритилган. Ўзбекистон
   Республикасининг 2014 йил 16 апрелда қабул қилинган Қонуни билан
   Ўзбекистон Республикасининг Конституцияси 32, 78. 93, 98, 103 ва
   117-моддаларига ўзгартиш ва қўшимчалар киритилган. Ўзбекистон
   Республикасининг 2017 йил 6 апрелда қабул қилинган Қонуни билан
   Ўзбекистон Республикасининг Конституцияси 80, 81, 83, 93, 107, 110 ва
   111-моддаларига ўзгартишлар ва қўшимча киритилган. Ўзбекистон
   Республикасининг 2017 йил 31 майда қабул қилинган Қонуни билан
   Ўзбекистон Республикасининг Конституцияси 80, 93, 108 ва
   109-моддаларига ўзгартишлар киритилган. Ўзбекистон Республикасининг
   2017 йил 29 августда қабул қилинган Қонуни билан Ўзбекистон
   Республикасининг Конституцияси 99 ва 102-моддаларига ўзгартишлар
   киритилган.)"""

tokenizer = nltk.data.load(
    os.path.join(SCRIPT_DIR, '../models/sentence-tokenizer-v1.pickle'))
print('\n'.join(tokenizer.tokenize(text)))
